// C-style comments.
// First non-comment line must be the following:
MCSkin3D Language File
// Following lines are key-value pairs, stored by the program.
// A line beginning with the pound/sharp/hash sign # are
// used internally and are not actual language pieces.
#Name=한국어
// Version is the version of the language file - it does not
// have any effect other than identification, and does not
// need to be present.
#Version=1.0
// SuppVersion is short for Supported Version, and denotes the version in which this
// language file was made for. Any other version running this file will throw an error.
#SuppVersion=1.4
// Culture is the Windows culture ID for the language.
// This is REQUIRED to be set properly!
#Culture="ko-KR"

// These lines are not required, they are simply for identification
// purposes.
#Author="Paril"
#AuthorContact="paril@alteredsoftworks.com"
#AuthorSite="www.alteredsoftworks.com"

// Below this are the key-value pairs; ID=String
// Note that the quotes are not required, but may be used for readability purposes.
// Language developers should use this file, and not other languages, to determine the
// context in which the string is deriving - otherwise, you may lose accuracy of your
// translation over time (see TranslationParty).
C_OK="확인"
C_CANCEL="취소"
C_CLOSE="닫기"
C_COPYTOCLIPBOARD="클립보드에 복사"

M_FILE="파일"
	M_SAVE="저장"
	M_SAVEAS="다른 이름으로 저장"
	M_SAVEALL="모두 저장"
	M_UPLOAD="스킨 업로드..."
	M_EXIT="끝내기"
M_EDIT="편집"
	M_UNDO="실행 취소"
	M_REDO="다시 실행"
	M_TOOL="도구"
M_VIEW="보기"
	M_MODE="보기 모드"
		M_PERSPECTIVE="원근 (3D)"
		M_TEXTURE="텍스처 (2D)"
		M_HYBRID="혼합"
	M_3D="3D 설정"
		M_ANIMATE="애니메이션"
		M_FOLLOWCUR="커서 따라가기"
		M_GRASS="잔디"
		M_GHOST="숨은 부위 유령 표시"
		M_MULTISAMPLING="멀티샘플링"
	M_2D="2D 설정"
		M_ALPHACHECKER="알파 체커판"
		M_OVERLAY="오버레이"
			M_ENABLEOVERLAY="사용"
	M_TRANSMODE="투명도 모드"
		M_OFF="끄기"
		M_HELMETONLY="헬멧만 표시"
		M_ALL="모두 표시"
	M_VISIBLEPARTS="보이는 부위"
		M_HEAD="머리"
		M_HELMET="헬멧"
		M_CHEST="가슴"
		M_LEFTARM="왼쪽 팔"
		M_RIGHTARM="오른쪽 팔"
		M_LEFTLEG="왼쪽 다리"
		M_RIGHTLEG="오른쪽 다리"
M_OPTIONS="옵션"
	M_KEYSHORTCUTS="키보드 단축키"
	M_BGCOLOR="배경색 (변경 후 재시작 필요)"
	M_USETEXTUREBASES="기본 텍스처 사용"
M_LANGUAGE="언어"
M_HELP="도움말"
	M_CHECKUPDATES="업데이트 확인"
	M_AUTOUPDATE="자동 업데이트 확인"

T_TREE_ZOOMOUT="축소"
T_TREE_ZOOMIN="확대"
T_TREE_IMPORTHERE="여기에 가져오기..."
T_TREE_NEWFOLDER="여기에 새 폴더..."
T_TREE_RENAME="이름 바꾸기..."
T_TREE_DELETE="삭제..."
T_TREE_CLONE="복제"
T_TREE_UPLOAD="업로드"

T_SAVE="저장"
T_SAVEALL="모두 저장"
T_UNDO="실행 취소"
T_REDO="다시 실행"
T_PERSPECTIVE="원근"
T_TEXTURE="텍스처"
T_HYBRID="혼합"
T_SCREENSHOT="스크린샷 (Shift 누르면 저장)"
T_TOGGLEHEAD="머리 표시/숨기기"
T_TOGGLEHELMET="헬멧 표시/숨기기"
T_TOGGLECHEST="가슴 표시/숨기기"
T_TOGGLELEFTARM="왼팔 표시/숨기기"
T_TOGGLERIGHTARM="오른팔 표시/숨기기"
T_TOGGLELEFTLEG="왼다리 표시/숨기기"
T_TOGGLERIGHTLEG="오른다리 표시/숨기기"
T_SWATCHES="색상 견본"

M_IMPORT_HERE="여기에 가져오기..."
M_NEWFOLDER="새 폴더"
M_NEWFOLDER_HERE="여기에 새 폴더..."
M_RENAME="이름 바꾸기..."
M_DELETE="삭제..."
M_CLONE="복제"

T_TOOL_CAMERA="카메라"
T_TOOL_PENCIL="연필"
T_TOOL_ERASER="지우개"
T_TOOL_DROPPER="스포이드"
T_TOOL_DODGEBURN="닷지/번"
T_TOOL_DARKENLIGHTEN="어둡게/밝게"
T_TOOL_BUCKET="페인트 통"
T_TOOL_NOISE="노이즈"

B_MSG_DIRMISSING="포함된 디렉터리가 없습니다. 일반적으로 프로그램을 압축 해제하지 않았기 때문입니다. 심각한 문제는 아니지만, 포함된 템플릿, 견본 및 기타 콘텐츠가 누락됩니다."
B_MSG_UPTODATE="최신 버전을 사용하고 있습니다!"
B_MSG_NEWUPDATE="새 업데이트를 사용할 수 있습니다. 지금 업데이트 프로그램을 열어 확인하시겠습니까?"
B_MSG_UPLOADERROR="스킨 업로드 중 오류 발생:"
B_MSG_UPLOADSUCCESS="스킨 업로드 성공!"
B_MSG_DELETESKIN="이 스킨을 삭제하시겠습니까?\r\n휴지통으로 이동됩니다."
B_MSG_DELETEFOLDER="이 폴더를 삭제하시겠습니까?\r\n휴지통으로 이동됩니다."
B_MSG_OVERLAYERROR="오버레이 이미지를 로드할 수 없음: “{0}”; 해상도가 2의 거듭제곱이어야 합니다."
B_MSG_UPLOADRES="MCSkin3D로 고해상도 텍스처를 편집할 수 있지만, Minecraft 프로필에 업로드할 수는 없습니다."
B_MSG_ANTIALIAS="멀티샘플링 옵션을 적용하려면 MCSkin3D를 다시 시작하세요."
B_MSG_PIXELFORMAT="죄송합니다. 그래픽 카드가 32비트 픽셀 형식을 지원하지 않는 것 같습니다. 현재 MCSkin3D 실행에 필요합니다."
B_MSG_SHORTCUTEXISTS="단축키 “{0}”이(가) “{1}”과(와) 충돌합니다. 초기화합니다."

B_CAP_QUESTION="질문"
B_CAP_SORRY="죄송합니다"

C_SQUARE="정사각형"
C_CIRCLE="원형"

O_EXPOSURE="노출:"
O_INCREMENTAL="증분"
O_LIGHTEN="밝게"
O_DARKEN="어둡게"
O_DODGE="닷지"
O_BURN="번"
Q_THRESHOLD="임계값:"

C_NEW="새로 만들기"
C_CANTMOVE="이동할 수 없음"
C_COPY="복사"
C_MOVE="이동"
C_MOVED="이동됨"
C_COPYTO="다음으로 복사"
C_MOVETO="다음으로 이동"
C_IMPORTTO="다음으로 가져오기"

C_SETTINGSFAILED="설정 파일을 불러오지 못했습니다. 기본 설정이 로드되었습니다."

C_AUTOLOGIN="자동 로그인?"
C_REMEMBER="기억하기?"
C_USERNAME="사용자 이름:"
C_PASSWORD="비밀번호:"
C_UPLOADTEXT="스킨을 업로드하려면 Minecraft.net에 로그인해야 합니다. 이 프로그램이 자동으로 처리할 수 있습니다. 사용자 이름과 비밀번호를 입력하여 계속하세요."

C_UPLOADING="스킨을 업로드하는 중입니다. 잠시만 기다려주세요..."
C_SHORTCUTINUSE="단축키가 이미 사용 중입니다"

S_TREEVIEW_ZOOMIN="트리 뷰 확대"
S_TREEVIEW_ZOOMOUT="트리 뷰 축소"
S_SWATCH_ZOOMIN="견본 확대"
S_SWATCH_ZOOMOUT="견본 축소"
S_COLORSWAP="전경색/배경색 교환"
S_RENAME="이름 변경"
S_CLONE="노드 복제"
S_DELETE="노드 삭제"
S_SCREENSHOT_CLIP="스크린샷을 클립보드로"
S_SCREENSHOT_SAVE="스크린샷 저장"
S_TOGGLEVIEW="보기 모드 전환"
S_TOGGLETRANS="투명도 모드 전환"

M_SHORTCUTS="아래 텍스트 상자를 클릭한 다음, 이 단축키에 할당할 키를 누르세요."
W_OPTIONS="도구 옵션 표시/숨기기"

T_CAMERA="마우스 왼쪽 버튼으로 회전. 마우스 오른쪽 버튼/휠로 확대/축소."
T_PENCIL="마우스 왼쪽 버튼으로 그리기; 마우스 오른쪽/휠로 회전/확대축소; Shift 키를 누르면 배경색 사용."
T_DROPPER="마우스 왼쪽 버튼으로 색상 선택. 마우스 오른쪽/휠로 회전/확대축소. Shift 키를 누르면 배경색으로 선택, 그렇지 않으면 전경색으로 선택."
T_DODGEBURN="마우스 왼쪽 버튼으로 닷지/번. 마우스 오른쪽/휠로 회전/확대축소. Shift 키로 도구 전환."
T_DARKENLIGHTEN="마우스 왼쪽 버튼으로 어둡게/밝게. 마우스 오른쪽/휠로 회전/확대축소. Shift 키로 도구 전환."
T_ERASER="마우스 왼쪽 버튼으로 투명색과 알파 채널로 지우기. 마우스 오른쪽/휠로 회전/확대축소."
T_FILL="마우스 왼쪽 버튼으로 픽셀 채우기. Shift 키를 누르면 배경색 사용. Ctrl 키를 누르면 부위 잠금. 마우스 오른쪽/휠로 회전/확대축소."
T_NOISE="마우스 왼쪽 버튼으로 노이즈 적용. 마우스 오른쪽/휠로 회전/확대축소."

C_UNSAVED="저장하지 않은 변경 사항이 있습니다. 종료하시겠습니까?"
C_UNSAVED_CAPTION="잠깐!"

O_HOLDNESS="유지 강도:"

G_BRUSH="브러시"
G_BRUSHOPTS="브러시 옵션"
G_NOISEOPTS="노이즈 옵션"
G_FILLOPTS="채우기 옵션"
G_TOOL="도구"

T_DECRES="해상도 낮추기"
T_INCRES="해상도 높이기"

M_NEWSKIN="새 스킨"
M_NEWSKIN_HERE="여기에 새 스킨"

M_SKINERROR="Minecraft 스킨 저장소에서 스킨을 다운로드할 수 없습니다!"
M_FETCH_NAME="Minecraft에서 가져오기"
M_FETCH_TEXT="MCSkin3D는 당신(또는 다른 사람)의 Minecraft 계정에서 스킨을 가져와 스킨 파일로 가져올 수 있습니다. 아래에 계정 이름을 입력한 다음 '가져오기'를 클릭하세요!"
M_PLAYER_NAME="플레이어 이름:"

C_YES="예"
C_NO="아니오"
D_DONTASK="다시 묻지 않음"
M_IRREVERSIBLE="주의: 고해상도 스킨은 Minecraft.net에 스킨으로 업로드할 수 없습니다!\n\n이 작업은 되돌릴 수 없으며, 이전의 모든 실행 취소/다시 실행 기능이 손실됩니다. 계속하시겠습니까?"

M_TEMP="임시 위치에서 MCSkin3D를 실행하려고 합니다. 프로그램을 올바르게 압축 해제한 후 실행하세요."

T_RESETCAMERA="카메라 초기화"
M_SKINDIRS="스킨 디렉터리"
M_DYNAMICOVERLAY="동적 오버레이"
M_DYNAMICOPTIONS="동적 옵션"
M_LINECOLOR="선 색상"
M_LINESIZE="선 굵기"
M_OVERLAYTEXTSIZE="텍스트 크기"
M_TEXTCOLOR="텍스트 색상"

U_PIXELSCHANGED="픽셀 변경됨"
T_TOOL_STAMP="스탬프"
T_STAMP="왼쪽 클릭으로 스탬프 사용. Shift + 클릭으로 영역을 브러시에 복사."
L_UNDOACTIONS="{0}개 작업 실행 취소"
L_REDOACTIONS="{0}개 작업 다시 실행"

M_BROWSE="{0} 위치 찾아보기"
M_SKIN="스킨"
M_FOLDER="폴더"

M_SHARED="공유 옵션"
M_INFINITEMOUSE="무한 마우스"

T_SWATCHEDIT="견본 편집"
T_DELETESWATCH="견본 삭제"
T_ADDSWATCH="견본 추가"

M_EXPT_EXCEPTION="예외 발생!"
M_EXPT_APPERROR="응용 프로그램 오류!"
M_EXPT_ERRORTEXT="MCSkin3D에 오류가 발생하여 불안정해질 수 있습니다. 하지만 걱정하지 마세요, 도움을 줄 수 있는 방법이 있습니다!\r\n\r\n개발자를 돕고 싶다면 오류 보고서를 보내주세요! 이 창의 맨 아래에 오류 보고서 내용을 가리키는 파란색 링크가 있습니다. 이를 저희에게 보내주시면(PlanetMinecraft에서 검색) 개발 작업에 큰 도움이 됩니다!"
M_EXPT_SHOW="이 메시지 더 이상 표시 안 함"
M_EXPT_CLOSE="닫기"
M_EXPT_VIEW="보고서를 보려면 클릭"
M_EXPT_HERE="여기"

C_RESTART="이 작업을 수행하려면 프로그램을 다시 시작해야 합니다!"
C_RESTART_CAPTION="재시작 필요"
D_UNSAVED="저장하지 않은 스킨이 있습니다. 스킨 디렉터리를 변경하면 스킨 목록이 새로고침되어 저장하지 않은 모든 변경 사항이 손실됩니다. '예'를 클릭하면 저장하지 않고 바로 새로고침하며, '아니오'를 클릭하면 재시작 후 새로고침하고, '취소'를 클릭하면 작업을 취소합니다."
D_UNSAVED_CAPTION="저장되지 않은 변경 사항"

M_RENDERSTATS="렌더링 통계"
M_GRIDCOLOR="격자 색상"
M_GRIDOPACITY="격자 불투명도"

M_LOADING="불러오는 중..."
M_NEWPALETTE="새 팔레트"
M_DELETEPALETTE="팔레트 삭제"
M_CONVERTSWATCH="견본 변환..."
M_RENAMEPALETTE="팔레트 이름 바꾸기"
M_CURRENTFORMAT="현재 형식:"
M_NEWFORMAT="새 형식:"
M_SWATCHQUESTION="이 작업은 이 팔레트를 영구적으로 삭제합니다. 계속하시겠습니까?"
M_SWATCHQUESTION_CAPTION="확실합니까?"

M_UPDATESTARTING="업데이트가 다운로드되었습니다. MCSkin3D가 종료되고 업데이터가 열립니다. 참고: 이 프로그램은 임시 폴더에서 실행되므로 Windows(또는 바이러스 백신)에서 경고할 수 있습니다. 걱정하지 마세요. 주 디렉터리를 업데이트 파일로부터 깨끗하게 유지하기 위한 것입니다."
M_REPORTVIEWER="보고서 뷰어"

M_GRIDENABLED="격자 표시"
M_RENDERRESTART="렌더링 모드를 변경하려면 재시작해야 합니다."
M_RENDERER="렌더러"
M_CLIENTARRAYS="클라이언트 배열"
M_IMMEDIATE="직접 모드"
W_POPOUT="팝아웃"

E_SKINERROR="스킨 “{0}”을(를) 불러오는 중 오류 발생. 이 파일을 삭제하거나 폴더에서 옮기세요."
T_TOGGLECHESTARMOR="흉갑 표시/숨기기"
T_TOGGLELEFTARMARMOR="왼팔 보호구 표시/숨기기"
T_TOGGLERIGHTARMARMOR="오른팔 보호구 표시/숨기기"
T_TOGGLELEFTLEGARMOR="왼다리 보호구 표시/숨기기"
T_TOGGLERIGHTLEGARMOR="오른다리 보호구 표시/숨기기"

M_CHESTARMOR="흉갑"
M_LEFTARMARMOR="왼팔 보호구"
M_RIGHTARMARMOR="오른팔 보호구"
M_LEFTLEGARMOR="왼다리 보호구"
M_RIGHTLEGARMOR="오른다리 보호구"

C_SCALE="크기 조절"
C_CROP="자르기"
M_SKINSIZEMISMATCH="이 스킨의 크기가 선택한 모델의 예상 크기와 일치하지 않습니다. MCSkin3D는 다음 두 가지 방법 중 하나로 이 문제를 해결할 수 있습니다:\n\n자르기: 스킨 자체는 수정하지 않고 크기를 모델에 맞게 직접 조정합니다. 크기 차이에 따라 스킨의 일부가 잘릴 수 있습니다. 스킨을 1.7 버전에서 1.8 버전으로 변환하는 경우 이 옵션을 사용하세요.\n\n크기 조절: 스킨을 필요한 크기에 맞게 확대/축소합니다.\n\n이 작업은 되돌릴 수 없습니다."